/*================================================================================

	ジョイントヘッダー[joint.h]

												Author: 齊藤 零登
												 Date : 2022/11/16
----------------------------------------------------------------------------------
Update:
	
================================================================================*/
#pragma once
#ifndef _JOINT_H_
#define _JOINT_H_

#include "main.h"

//**************************************************
// マクロ定義
//**************************************************
#define JOINT_MAX		64


//**************************************************
// 構造体・列挙型
//**************************************************
// ジョイントタイプの列挙型
enum class JOINT_TYPE
{
	TYPE_BUMP = 0,				// 凸
	TYPE_DIP,					// 凹
	TYPE_MAX
};

// ジョイント構造体
typedef struct
{
	D3DXVECTOR2 pos;			// 中心座標
	D3DXVECTOR2 size;			// サイズ
	D3DXCOLOR	color;			// 色
	int pieNo;					// ピース番号
	JOINT_TYPE type;			// ジョイントタイプ
	float texNo;				// テクスチャ番号
	
	bool useFlag;				// 使用中フラグ
}JOINT;

//**************************************************
// プロトタイプ宣言
//**************************************************
//[----------基本関数----------
void InitJoint();
void UninitJoint();
void UpdateJoint();
void DrawJoint();
//----------基本関数----------]


//----------ジョイントセット関数----------
// 引数：座標, サイズ, ピース番号, ジョイントタイプ
void SetJoint(D3DXVECTOR2 po, D3DXVECTOR2 si, int no, JOINT_TYPE ty);


//----------ジョイントゲット関数----------
JOINT* GetJoint();


//----------ジョイント削除関数----------
// 引数：ピース番号
void DeleteJoint(int no);



#endif // !_JOINT_H_
