/*==============================================================================

   パズル操作ヘッダー [OperatePiece.h]
														 Author : 伏木　伶
														 Date   : 2022/11/08
--------------------------------------------------------------------------------
 Update:
==============================================================================*/

#pragma once
#ifndef _OPERATEPIECE_H_
#define _OPERATEPIECE_H_

#include "main.h"
#include "renderer.h"
#include "MapChip.h"

//**************************************************
//　マクロ定義
//**************************************************
#define PIECE_SIZE (180)
//**************************************************
// 構造体定義
//**************************************************

//**************************************************
// プロトタイプ宣言
//**************************************************

//**************************************************
// グローバル変数:
//**************************************************


class OperatePiece {
private:

public:
	HRESULT Init();
	void Uninit();
	void Update();
	void Draw();
	void Rotate(int PieceNo);
	void SetOperatePiece(D3DXVECTOR2 pos, int PieceNo);
};

#endif // !_OPERATEPIECE_H_
